artillery-tests/16.yml

config:
  target: 'http://localhost:8080'
  phases:
    - duration: 1 
      arrivalRate: 1
  http:
    timeout: 30
scenarios:
  - flow:
    - loop:
      - post:
          url: /evaluateSync
          body: |
                "<Request xmlns=\"urn:oasis:names:tc:xacml:3.0:core:schema:wd-17\" CombinedDecision=\"false\" ReturnPolicyIdList=\"true\"><Attributes Category=\"urn:oasis:names:tc:xacml:1.0:subject-category:access-subject\"><Attribute AttributeId=\"urn:oasis:names:tc:xacml:1.0:subject:subject-id\" IncludeInResult=\"false\"><AttributeValue DataType=\"http://www.w3.org/2001/XMLSchema#string\">1</AttributeValue></Attribute></Attributes><Attributes Category=\"urn:oasis:names:tc:xacml:3.0:attribute-category:resource\"><Attribute AttributeId=\"urn:oasis:names:tc:xacml:1.0:resource:resource-id\" IncludeInResult=\"true\"><AttributeValue DataType=\"http://www.w3.org/2001/XMLSchema#string\">resource16c</AttributeValue></Attribute></Attributes></Request>
          headers:
            content-type: application/json
      count: 1